app/controllers/school_classes_controller.rb

  def create
    @school_class=SchoolClass.create(school_classes_params(:title,:description))
---
INSERT INTO "school_classes" ("title") VALUES (?)  [["title", "Computer Science"]]

  def update
    @school_class=SchoolClass.find(params[:id])
    @school_class.update(school_classes_params(:title,:description))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["id", 1]]