app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-01-21 21:22:27.402841"], ["updated_at", "2019-01-21 21:22:27.402841"]]
---
  def create
    @student=Student.create(students_params(:first_name,:last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-01-21 21:53:00.799435"], ["id", 1]]
---
  def update
    @student=Student.find(params[:id])
    @student.update(students_params(:first_name,:last_name))